Revit 2026 API
StairsEditScope Class
 StairsEditScope allows user to maintain a stairs-editing session.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EditScope
 Autodesk.Revit.DB.StairsEditScope
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class StairsEditScope : EditScope
Public Class StairsEditScope
	Inherits EditScope
public ref class StairsEditScope : public EditScope
type StairsEditScope =
    class
        inherit EditScope
    end
The StairsEditScope type exposes the following members.
Constructors
Name | Description
StairsEditScope |  Instantiates a StairsEditScope object.
Top
Properties
Name | Description
IsActive |  Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
(Inherited from EditScope)
IsPermitted |  Tells if the edit scope is permitted to start.
(Inherited from EditScope)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from EditScope)
Top
Methods
Name | Description
Cancel |  Cancels the edit scope.
(Inherited from EditScope)
Commit |  Finishes the edit scope.
(Inherited from EditScope)
Dispose
(Inherited from EditScope)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Start(ElementId) |  Starts an stairs edit mode for an existing Stairs element
Start(ElementId, ElementId) |  Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 Start/end of a StairsEditScope will start/end a transaction group. After a StairsEditScope is started, user can start transactions and edit the stairs. Individual transactions the user creates inside StairsEditScope will not appear in the undo menu. All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into StairsEditScope constructor.
See Also
Reference
Autodesk.Revit.DB Namespace